# 1 TODO заменить значение пропущенного элемента средним арифметическим
numbers = [2, -93, -2, 8, None, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]

numbers[4] = sum(numbers[:4]+numbers[5:])/len(numbers)

print("Измененный список:", numbers)

# 2 TODO Найдите количество книг, которое можно разместить на дискете
n = 100 * 50 * 25 * 4
i = 1.44 * 1024 * 1024
print("Количество книг, помещающихся на дискету:", int(i//n))

# 3 TODO Разделите участников на две команды
list_players = ["Маша", "Петя", "Саша", "Оля", "Кирилл", "Коля"]
list1 = list_players[:len(list_players)//2]
list2 = list_players[len(list_players)//2:]
print(list1)
print(list2)

# 4 TODO Добавьте словарь и замените в нем нулевые значения статисчикой посещений
users = ['user1', 'user2', 'user3', 'user1', 'user4', 'user2']
s = {
    "Общее количество": 0,
    "Уникальные посещения": 0
}
s["Общее количество"] = len(users)
s["Уникальные посещения"] = len(set(users))
print(s)